from pulp import *

# Створення проблеми оптимізації
prob = LpProblem("Оптимізація виробництва", LpMaximize)

# Оголошення змінних
x1 = LpVariable("Лимонад", lowBound=0, cat='Integer')  # кількість одиниць лимонаду
x2 = LpVariable("Фруктовий сік", lowBound=0, cat='Integer')  # кількість одиниць фруктового соку

# Додавання функції максимізації
prob += x1 + x2, "Всього напоїв"

# Додавання обмежень
prob += 2*x1 + x2 <= 100  # Обмеження для інгредієнту 1
prob += x1 + 3*x2 <= 90   # Обмеження для інгредієнту 2

# Вирішення проблеми
prob.solve()

# Виведення результатів
print("Результати оптимізації виробництва:")
for v in prob.variables():
    print(v.name, "=", v.varValue)

print("Максимальна кількість вироблених продуктів: ", value(prob.objective))
